{"reviews": ["Sushi Bruce is my go to sushi place in Baltimore.This\n                        is the new location in fells point and the ambiance here\n                        is my favorite. The food is amazing and is the portion\n                        size is perfect for sharing.The sushi rolls\n                        are fresh and hand made by Bruce!", "I was happy to hear that the same owners of Shoyou\n                        Sushi opened up a spot a little closer to me in Fells\n                        Point. Being able to get incredibly high quality sushi\n                        without having to go to Fed Hill is a win in my book\n                        (yes, that was a jab at Federal Hill). The\n                        inside is brand new looking and fairly modern. We went\n                        on a Monday night and it was pretty busy. The staff\n                        seemed extremely unprepared. There was one front of\n                        house person acting as hostess and server for the entire\n                        dining room. Tables were sitting dirty for a good while\n                        before finally being bussed. And we had actually been\n                        warned by two other patrons before sitting down (one we\n                        knew and another a complete stranger), that the wait\n                        time was atrocious. We were a bit nervous but sat down\n                        anyways... and I'm glad we did!Once we\n                        finally received a menu about 10/15 minutes after\n                        sitting down, we ordered a ton of nigiri, maki rolls,\n                        and one specialty roll. Just like with Shoyou Sushi, the\n                        quality of the fish is amazing. The fatty tuna was\n                        absolutely to die for and melted in your mouth. My\n                        boyfriend immediately wanted to order another round of\n                        it, it was that good! Our server, who was\n                        clearly trying her best and keeping a friendly demeanor\n                        throughout it all, got most of the order correct with\n                        the exception of one maki roll which was tuna instead of\n                        yellowtail. We also got some sake to drink which was\n                        yummy. However, one of the glasses we received was\n                        really dirty and we needed to ask for another.\n                        All this aside, I would still return. The\n                        food was great and despite the hiccups in the service, I\n                        truly think they are just new and still getting in the\n                        swing of things. Hopefully, they'll staff more\n                        adequately in the future to help with wait times and the\n                        other misses.", "Nestled in the heart of Fells, you'll find Sushi Bruce\n                        Ya, boasting a cozy atmosphere. My husband and I decided\n                        to have dinner here on a Saturday evening. Although the\n                        place was bustling, we were promptly seated. Our server\n                        was both friendly and attentive. My overall impression\n                        of the food was just average, but I'll cut them some\n                        slack since they had recently opened. Unfortunately,\n                        many of the sashimi options I wanted to order were\n                        unavailable, which was disappointing. However, they\n                        kindly provided us with a complimentary appetizer, which\n                        was a nice gesture.I particularly enjoyed\n                        the ika salad and tuna tartar; they were exceptionally\n                        delicious and fresh. On the other hand, the sashimi and\n                        nigiri seemed to lack a bit of freshness, possibly due\n                        to being defrosted for too long, resulting in a somewhat\n                        soggy and warm texture. Nevertheless, the fish itself\n                        still exhibited signs of freshness, and the portions\n                        were quite generous. My husband ordered the sushi\n                        burrito and enjoyed it, and we also tried a roll (whose\n                        name we forgot), which was also good.Overall,\n                        I wouldn't mind returning to give them another chance. I\n                        see potential in this place and am glad to see a new\n                        restaurant in this part of the city.", "Great spot for sushi in the Fell's Point area! My\n                        friend and I both really enjoyed the sushi here. The\n                        prices were very reasonable for the portion size and\n                        quality. The service was great and our food came out\n                        pretty quick. I'll definitely be back here again!", "4.5 but rounding up to 5 since it's a new restaurant!\n                        Sister restaurant to shoyou and in a more convenient\n                        location for me. The menu is similar and the quality is\n                        the same. I came in knowing that this restaurant is\n                        better known for more non traditional/elaborate sushi,\n                        and it does them well. Wouldn't come here for simple\n                        sashimi/sushi.", "Hands down the best sushi in Baltimore. We were so\n                        excited to hear that a second Sushi Bruce location was\n                        opening in Fells Point. We went into the restaurant on\n                        opening night. They completely renovated the interior of\n                        the space and it looks great! They have a lot of seating\n                        compared to the Fed Hill location which is nice. Must\n                        haves: start with the garlic edamame. It is the perfect\n                        app. Hot Night Baby, Big Boss, Hawaiian Ahi Tuna, and\n                        the Sushi Burrito are absolutely delicious. The sushi\n                        portions are large and you will leave stuffed! The staff\n                        is really friendly and attentive. They even gave us a\n                        free calamari app since it was opening night. Run don't\n                        walk to Sushi Bruce you will not regret it!", "I have been eagerly awaiting the opening of Sushi Bruce\n                        Ya since the sign went up months ago! It's open now and\n                        glorious. If you're a fan of Shoyou sushi, it's pretty\n                        much the same menu but located on the other side of\n                        town! It also expands the number of customers that can\n                        enjoy the ginormous rolls and fresh food every day!\n                        The interior is a bit different from Shoyou\n                        and there isn't a sushi bar but it still is super\n                        comfortable and service is timely. The menu is huge and\n                        you'll need some time to read the menu since it's a\n                        complex menu but it just means that there are more items\n                        to enjoy! The rolls are huge and the fish is always\n                        fresh! I would highly recommend asking the waitstaff how\n                        many things you should order for portions and for\n                        recommendations. The restaurant didn't have a liquor\n                        license when I went so I'm looking forward to when they\n                        get theirs!", "This is from the same owner of the beloved Shoyu Sushi\n                        in Fed Hill. I'm excited for another sushi spot to open\n                        in fells point as there is a lack of good sushi in the\n                        area. I will say this location and decor is 4 stars. The\n                        food is closer to 3.5. I'm pretty simple when I comes to\n                        sushi. I love sashimi and unfortunately there's not a\n                        lot of sashimi options here. Only some tuna, salmon and\n                        yellowtail. I went on a Wednesday and it was pretty\n                        busy! I think most of us locals are excited for another\n                        sushi spot to open. If you love fancy rolls with lots of\n                        fixings this is the place for you. I will most likely\n                        come back but the maki rolls was the\n                        disappointing.", "The sushi gods have answered my prayers!!!!!! Now I\n                        don't have to drive all the way to Fed for my favorite\n                        rolls ^_^ Sushi Bruce Ya offers that same familiar taste\n                        we all know and love (and would sell our souls for) just\n                        in a larger setting. The interior of the new space is\n                        beautiful and spacious! Service was ok--might need a\n                        little more training (ex--she asked if we wanted ice in\n                        our beer glasses? Never heard that one before.) One stop\n                        closer to a Shoyou location in the county and then I'll\n                        really be in heaven!", "Super good, good sized portions. $25 (+tip) for the Hot\n                        Night Baby sushi roll which was super big and filling.\n                        Really good sushi and I really enjoyed it!"], "analyzedData": {"sentiment": 32.17, "popular": 100.0, "summary": "This restaurant got the best compliments", "img": "best.png"}}