{"reviews": ["Although sushi burritos have been on the scene for a few years, it's nice to have them in town! The restaurant had a nice lunch crowd but I was still able to get my food pretty quickly. The custom burrito I got was packed well and even though I didn't get to eat it until about 45 minutes later, it was still flavorful and the ingredients maintained their integrity. I know I could get a Mexican burrito for a few dollars cheaper but this is still a tasty and filling meal that you don't find everywhere. I'm tempted to try the broth/noodle dishes but am a little hesitant about how authentic they'll be.", "I really wanted to like this place but the food was disappointing. We were greeted as soon as we walked in and everyone that worked there was nice. I went for the build your own noodle bowl. The beef broth tasted like water. There was no flavor to it at all. They seemed very disorganized and unsure of how to prepare the bowl which held up the line.The beef was like rubber and impossible to eat. They added chicken to my bowl which I didn't ask for. My significant other got the tofu which tasted stale and rubbery too. The only good part was the serving size. It was massive and I could only eat half the bowl.We're not hard to please but if this restaurant wants to keep their spot at foundry row they need to improve their food. They already have the nice staff but the food needs to be good. I don't think we will be going back.", "To start, this plaza has everything in it!!!! I ate lunch at Poke Bowl with my coworkers for lunch. I ordered the shrimp and chicken bowl with yum yum sauce. Man oh man!! It was perfect. To top it off, the staff was really nice. I would definitely recommend this restaurant!", "This place is looks going to Chipotle, except for it's a poke bowl! They have a myriad of options, from proteins to toppings to dressings and each one of them can take your bowl to the next level. The place is clean and the staff is courteous, however, they aren't as knowledgeable about the different sauces and toppings. Overall, good value and good taste.", "I walk in because it's a new place and decide to try something new. Being a new customer I was having some confusion with the menu. So the lady says look at the menu and I'll come back and walks away. No help at all. The other worker then took my order and helped. I couldn't mix and noodles and rice , couldn't get certain meet with noodles, and there were other rules to ordering. Never have I experienced so many rules and things you cant do to order food I'm oayinCustomer service was horrible!", "Quick service! Everything tastes fresh! I like the variety of toppings here. I got a poke Bowl this time, but will be back for a noodle bowl soon!", "The food is always so great! I get the same thing veggie poke bowl with chicken tempera and shrimp! Also, the staff is so POLITE! I will always come here. Love itttt", "food is delicious!! great service, great place to dine in and amazing food. 100% recommend. The bowls are the most popular and what I typically get.", "I love this place. I love poke bowls and burritos and was so excited they finally opened up a place near by. Before this place opened the closest poke restaurant to me was all the way out Towson. I always get the salmon and spicy tuna with lots of fresh ingredients and sauces.", "Just driving down Reisterstown road. Thought it would be a good place for a fast dinner. It was excellent. Everybody was so friendly. The owner, Darren explained the Hawaiian bowl concept to us in great detail. Explain the different sauces and gave us samples. We ended up with one bowl to share and tried the sushi. Everything was very fresh and tasty. The staff was very attentive. It's a BYOB which is a double plus for us. Can't wait to go back with some of our friends. It's a very casual atmosphere with a few tables. Looks like they have a very good takeout business also.", "My boyfriend and I had a bowl of pho and a poke burrito. The poke burrito was very good, ingredients were fresh. The restaurant was clean, service was good but the pho was definitely lacking. It was just regular beef broth with noodles and the other ingredients thrown together. It did not taste authentic. But overall the restaurant is good and I recommend visiting for poke.", "I get the crazy poke burrito every time I go and it is excellent!!! This place is clean and the staff is all very friendly. I went for the first time and returned a couple days later to get the same thing again... that's how good these burritos are :)", "Went into today. Asked for one protein and was given two scoops of tuna. I asked the guy when I was paying for two scoops when I asked for one he said that since I didn't pick other things in my bowl I was given two scoops. When I was there the last time my bowl was 7.95 and this time it was 11.95 not sure why the price went up. Needless to say I will be waiting awhile to come back. I will find another poke spot to go to. There's no number to call and complain about it since they are all owned individually. I will be calling Monday morning. I am sorry for not getting other items in my bowl your going to charge me for more protein when I didn't say I wanted more."], "analyzedData": {"sentiment": 23.76, "popular": 84.62, "summary": "This restaurant is very good", "img": "verygood.png"}}