{"reviews": ["Took about 35-40 minutes for delivery (Grubhub). Food was warm and not too greasy. Second time ordering from them and  the food has been consistent so far.", "Unless you like cold Chinese food, don't order here. Food was almost an hour late. There's too many Chinese restaurants in this area for them to have this type of service!", "Service was pretty fast. My fave is the baltimore roll!! They also have coupons on grubhub for $7 off of a $15 order.", "Not impressed with the food quality or flavor. They do have discounts on restaurant.com so that's a plus. Didn't have any napkins out for guests. Don't think I'd return.", "They have one of the best spicy chicken dishes I have ever had in a Chinese restaurant. Their Chicken with Schezuan pepper is absolutely delicious. I must emphasize that this dish doesn't seem to have any schezuan peppers. What it does have is jalapeño peppers and some dried red chilli peppers with plenty of deep fried pieces of chicken.  It is very flavorful and packs quite a heat. I love it!!! I highly recommend trying it if you love spicy chicken.The small portion is plenty enough for one person and the large portion is in fact 'large' and enough for 2 people. The picture is of the large portion of the dish.Giving four stars as some of the other dishes I've tried weren't very good. But it has not stopped me from going back for the chicken with schezuan peppers time and again!! This is more of a takeout/delivery restaurant with limited seating areas. The people are very friendly though! So wouldn't mind dining in either.", "I ordered the shrimp and broccoli with white rice and it came with a spring roll. Everything was standard American chinese food and really delicious.  I wish the spring roll was bigger.  It was really good as well.  I will be back for more.", "Not many places deliver to Reisterstown, MD, so I like that this place delivers. Their sushi is great, and I've always been happy with it-- but recently I ordered Sesame chicken, and it tasted really off.. and really fishy, which put me off. I couldn't eat more than a bite.. I gave it to my co-worker for her to try (maybe it was just me?) and she said the same thing..Too bad, I really liked this place.", "This place is my go to for Chinese! They have good quality Chinese! Always friendly and fast. I've never had the sushi but according to the review that I just read I'll probably give it a try soon.They have the best Shrimp with garlic sauce in the area. I've tried plenty of different Chinese places in the area and none compare. Whenever I order a shrimp dish, the shrimp are large, cleaned and never over cooked. I did notice if you order the dinner special, the shrimp are sometimes smaller. The dishes still have great flavor nonetheless. The egg drop soup, egg foo young, yat gam mien, and Singapore rice noodle are all great dishes full of flavor.I order delivery a lot as well. The minimum for lunch delivery (which ends at 3pm every day) is $10 and dinner delivery $15. Always fast and delivery guy is nice. They are also open every single day except Thanksgiving.", "I don't know what people see in this place, I mean just go inside and you will see a dirty sushi bar. Look for your self if you don't believe me. I can't speak on the food because I walked in and walked back out. The whole sushi bar is filthy. There's no way in hell I would eat sushi from this place. Maybe my standards are  just too hot but when it comes to sushi you're supposed to have a germ-free environment due to the sensitive nature of  raw or steamed seafood! Good luck", "Delicious food!! My favorite is the general tso chicken combo! The family that owns the shop are awesome! Definitely recommend this place!", "I absolutely love Chinese food its one of my favorite things to eat for almost any meal.  I ordered some sushi, general tso's chicken and some pork lo mein.  The pork lo mein was just ok it lacked any real flavor to it.  The general tso's chicken I never got I was given something different instead that was closer to sweet and sour chicken then anything.  The sushi was just bad all 3 rolls I ordered were falling apart and didn't hold together.  The order did come pretty quickly though which is a plus. Overall if you are considering this place save yourself the trouble and order from Asia Garden by the Exxon their Chinese food and sushi is the best in town.", "Does Reisterstown need another takeaway/delivery joint? Apparently, yes. Rice Kitchen newly occupied a slot in the Landmark Shopping Center behind Chartley Park Shopping Center. Their Asian-inspired menu's marginally more atypical than other area Asian-inspired takeaway/delivery by offering items like Water Spinach (Hollow Vegetable), Hunan Squid, Fried Chinese Filet of Flounder, and Fruit Salad.The Aromatic Squid at $10.50 was more tough than rubbery bedded by a huge stash of shredded lettuce. Nice if not amazing. A Ginger Oyster Soup at $3.00 (pint) brought plentiful spicy ginger taste to bear though scant of actual oysters. The appetizer of 4 shipped-in sushi for $6.95 was merely a serviceable tease of the usual suspects of ebi, sake, maguro, etc. Ordering via website - something I've not seen at akin area takeaways - also helps set this joint slightly apart.Flaunting unexpected items outside of the same old Asian-inspired takeaway/delivery fare had high appeal for me although my overall meal as executed remained reasonably a-ok as expected. Nothing so egregious as to keep me from ordering again.", "Quick delivery time and the food was good, nothing to brag about. Served the purpose.", "Absolutely horrible. Especially if you order vegan/vegetarian.The order took forever.  The miso soup was fair.The kimchi smelled awful, had a bad taste and was way too salty.The bean curd for my wife and for  my order was poorly cooked. It was stringy and inedible.  They also didn't know how to cook broccoli.  We threw it all out.Stay away.", "I ordered General Tso's Bean Curd, Fried Bean Curd w/vegetables, and a sweet potato sushi roll via the Eat24 app. Unfortunately I received General Tso's chicken... instead of bean curd. I would urge anyone ordering vegetarian to reinforce that they want bean curd.On another note: The delivery was quick and the food was hot & delicious. My fiance ate the chicken and I happily enjoyed my sushi and entree. I still wish that they would have gotten my order correct though! I was looking forward to some general tso's tofu.", "Delivery was a tad slower than promised, but the food arrived hot. Great sushi (try the MD Sea King Roll) and great prices. I love that their dinner/combination platters come with the option of 2 crabmeat wontons instead of an egg roll. Sometimes I really want wontons but I don't buy them because they give you 8 and I can't (shouldn't) eat all of them. So I love that concept. It's a great alternative to Sonny Lee's, who doesn't deliver. I will be back!", "After reading other reviews I was surprised to see the quality of this food . Burnt wontons burnt boneless ribs. Wasted $30. First time last time. Only plus is the food was hot.", "Plus: I like that they have the option of online ordering. Plus: I ordered my food at 820pm on a Friday night, the food got here at 845pm a lot sooner than grubhub estimated.Plus:generous portions and friendly driver Minor con: food could have used a little more spice but that's just my opinion.I ordered the spicy coleslaw, chicken and string bean platter, pork fried rice and crab wontons.", "I couldn't get away for lunch and wanted to find a place to deliver Chinese food.  I saw the great reviews on Yelp for the Rice Kitchen and placed an order for delivery.  I ordered bourbon chicken, shrimp toast and chicken wings.  My food arrived within 45 minutes nice and hot.  However, when I began to open and unwrap my order, everything looked strange.  The bourbon chicken looked nothing like any bourbon chicken I've ever had.  The shrimp toast looked burnt and tasted absolutely terrible.  The chicken wings were the only thing recognizable.  I was so disappointed and ended up throwing most of the food away.", "We get delivery from here all the time. It is always delivered fast and it is always good. Their shrimp dishes are awesome ! The shrimp are always big and flavorful which is nice because at other places the shrimp are usually small in size compared to this place. We haven't ordered anything from here that we didn't enjoy. Plus you get free General Tso's with any order over 30 dollars !", "We get delivery from here all the time. It is always delivered fast and it is always good. Their shrimp dishes are awesome ! The shrimp are always big and flavorful which is nice because at other places the shrimp are usually small in size compared to this place. We haven't ordered anything from here that we didn't enjoy. Plus you get free General Tso's with any order over 30 dollars !", "Rice Kitchen is by far one of the best Asian restaurants in Reisterstown.  The sushi is very good as well as fresh.  The customer service is excellent.  I urge everyone to give Rice Kitchen a visit you won't be disappointed.", "My favorite Chinese restaurant in this area.  Fast delivery.", "I don't really have any complaints besides how long delivery took. But the orange chicken was average not really that good. The shrimp tempura tasted different than anywhere else. But overall the food was decent. I will order again if I'm desperate for delivery", "Good quality, fast delivery, hours cover lunch to dinner, and they are always willing to substitute in tofu for meat dishes, really a go-to place for me for food delivery.", "I usually hate carry out Chinese food. This is the first one I liked. I'll come back. I tried the General Tso's shrimp and egg rolls. Pretty good.", "I always order delivery from Rice Kitchen. They are always prompt and have really good deals. Their sushi is very reasonably priced and since I'm usually ordering for 2, I can use one of their coupons. If you spend more than $30, yo get a free order of General Tso's chicken. My favorite roll is the Baltimore Roll.", "Im used to having great sushi from living in DC and Southern Cali for years. I think this might be one of the best sushi places in the area. Their fish is not only very fresh but they also give big cuts in their sashimi and rolls. More specifically their dynamite roll is dynamite, they make it exactly how i like it and very few places do it that way anymore. Their pricing is also very reasonable. I highly recommend this place and the fact that they deliver make it a clear winner in my book", "Great food no msg good sushi. Sushi combo is a great deal. The only down fall is how long it takes for delivery", "What fun, surprise ingredients!Shrimp with garlic sauce shrimp (firm and not overcooked)broccoli (Lots and Lots)black fungus mushrooms (yummy)water chestnuts (good and crunchy)bamboo shoots (slim strings)onions (little chunks)Spicy sauce (not much garlic, but tasty)Hot and Sour Soupspotted white mushrooms (are those age spots?)dofu (long strips of firm tofu)eggfungus (same as above)celery (not too much)leeks or green onions (kind of hard to tell now)carrots (just a bit for color?)Spring roll (Big)cabbagecarrotslettuce?(Kind of oily and boring)", "Just found this place. We live in Finksburg and have been growing frustrated with the few Chinese food choices we have in and around Westminster - very inconsistent from one meal to the next and never really better than 'just okay'. We ordered a variety of dished from Rice Kitchen to test it out and really enjoyed the garlic chicken, general tso's chicken, pork lo mein, pork fried rice, and bourbon chicken. The only thing that had mixed reviews was the pu pu for  2 platter due to the shrimp toast and fried shrimp being just okay. But what a find overall. We're one happy family as this is the best place we've found outside of Little China in Philly for Chinese Food.", "I ordered Rice Kitchen through Grub Hub. I'm a big sushi lover so any place that delivers is key to me... Well not when it takes almost 2 hours to arrive and then not only that it SUCKED. I ate half of what I ordered and threw the rest away. To top it all off, I woke up at 3am and could not leave the toilet(TMI) I would NEVER recommend this place to anyone.. unless you want food poisioning.", "I am not a big Chinese food fan, but the chicken cashew is to die for and they are fast!", "My favorite here is the General Tso's hands down. I'm not sure how they do it but the chicken is always crispy and tender although it's covered in sauce.The bone in ribs are also tasty."], "analyzedData": {"sentiment": 10.75, "popular": 47.06, "summary": "This restaurant is average", "img": "ok.png"}}